samples/SOAP XML/IOS+/CreateOrder_OrderCreate3_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <OrderCreate3 xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <ServiceSessionKey>AFE94D66-E697-453F-BA0E-47F2ABACFFED@IDS-TEST</ServiceSessionKey>
          <RequestID>80A00814-CBD0-4D39-9BEA-3F60D73CBB4E</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <ParentOrderNumberArray xsi:nil="true" />
          <SideCodeArray>
            <SideCode>1</SideCode>
          </SideCodeArray>
          <AccountCodeArray>
            <AccountCode>A001</AccountCode>
          </AccountCodeArray>
          <SecurityCodeArray>
            <SecurityCode>IRE</SecurityCode>
          </SecurityCodeArray>
          <ExchangeArray>
            <Exchange>ASX</Exchange>
          </ExchangeArray>
          <DestinationArray>
            <Destination>DESK</Destination>
          </DestinationArray>
          <OrderMatchIDArray xsi:nil="true" />
          <OrderVolumeArray>
            <OrderVolume>777</OrderVolume>
          </OrderVolumeArray>
          <OrderPriceArray>
            <OrderPrice>777</OrderPrice>
          </OrderPriceArray>
          <PricingInstructionsArray>
            <PricingInstructions>2</PricingInstructions>
          </PricingInstructionsArray>
          <LifetimeArray>
            <Lifetime>0</Lifetime>
          </LifetimeArray>
          <ExpiryDateTimeArray xsi:nil="true" />
          <ExecutionInstructionsArray xsi:nil="true" />
          <WorkArray xsi:nil="true" />
          <AcknowledgeOrderArray xsi:nil="true" />
          <CurrencyArray xsi:nil="true" />
          <SubDestinationArray xsi:nil="true" />
          <PrimaryClientOrderIDArray xsi:nil="true" />
          <SecondaryClientOrderIDArray xsi:nil="true" />
          <OrderGroupArray xsi:nil="true" />
          <OrderDetailsArray xsi:nil="true" />
          <CustomColumnsArray xsi:nil="true" />
          <OrderGiverArray xsi:nil="true" />
          <OrderTakerArray xsi:nil="true" />
          <IgnoreLimitWarningsArray xsi:nil="true" />
          <ExecutionInstructionsDictionaryArray xsi:nil="true" />
          <CustomColumnsDictionaryArray xsi:nil="true" />
          <TrailerCodeOnMaskArray xsi:nil="true" />
          <OrderTagArray xsi:nil="true" />
          <UseDefaultOrderAttributesArray xsi:nil="true" />
          <BasketNameArray xsi:nil="true" />
          <BrokerBookTypeArray xsi:nil="true" />
          <BrokerBookValueArray xsi:nil="true" />
          <OrderValueArray xsi:nil="true" />
          <PriceMultiplierArray xsi:nil="true" />
          <SellOrderGroupingOptionArray xsi:nil="true" />
          <IsLegArray xsi:nil="true" />
          <TradingPassword xsi:nil="true" />
          <CountryCodeArray xsi:nil="true" />
          <RootSymbolArray xsi:nil="true" />
          <ExerciseDateArray xsi:nil="true" />
          <ExercisePriceArray xsi:nil="true" />
          <CallOrPutArray xsi:nil="true" />
        </Parameters>
      </Input>
    </OrderCreate3>
  </soap:Body>
</soap:Envelope>